# IsValidCategoryId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShape..::..IsValidCategoryId Method
DirectShape Class See Also
---
Test the category id to make sure the category is allowed for a DirectShape or DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static bool IsValidCategoryId(
	ElementId categoryId,
	Document doc
)
```

Visual Basic
---
```text
Public Shared Function IsValidCategoryId ( _
	categoryId As ElementId, _
	doc As Document _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidCategoryId(
	ElementId^ categoryId,
	Document^ doc
)
```

# ### Parameters
categoryId
    Type: Autodesk.Revit.DB..::..ElementId Category id to be tested.
doc
    Type: Autodesk.Revit.DB..::..Document Document to look up the category by id.
# ### Return Value
True if the category is allowed for a DirectShape or DirectShapeType, false if not.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShape Class
Autodesk.Revit.DB Namespace